diplom-src/src/Documents/ВКМ_НачислениеФиксированнойПремии/ВКМ_НачислениеФиксированнойПремии.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВКМ_НачислениеФиксированнойПремии</name>
  <registerRecords>CalculationRegister.ВКМ_ДополнительныеНачисления</registerRecords>
  <registerRecords>CalculationRegister.ВКМ_Удержания</registerRecords>
  <registerRecords>AccumulationRegister.ВКМ_ВзаиморасчетыССотрудниками</registerRecords>
  <tabularSections>
    <name>СписокСотрудников</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.ВКМ_Сотрудники</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидРасчета</name>
      <type>
        <types>ChartOfCalculationTypesRef.ВКМ_ДополнительныеНачисления</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНачисления</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

diplom-src/src/AccumulationRegisters/ВКМ_ВыполненныеСотрудникомРаботы/ВКМ_ВыполненныеСотрудникомРаботы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ВКМ_ВыполненныеСотрудникомРаботы</name>
  <resources>
    <name>ЧасовКОплате</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаКОплате</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.ВКМ_Сотрудники</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

diplom-src/src/Documents/ВКМ_НачислениеФиксированнойПремии/Forms/ФормаДокумента/Module.bsl
&НаСервере
Процедура ЗаполнитьНаСервере()

	Объект.СписокСотрудников.Очистить();

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
				   |  ВКМ_ВыполненныеСотрудникомРаботыОбороты.Сотрудник КАК Сотрудник,
				   |  СУММА(ВКМ_ВыполненныеСотрудникомРаботыОбороты.СуммаКОплатеПриход) КАК СуммаКОплатеПриход
				   |ИЗ
				   |  РегистрНакопления.ВКМ_ВыполненныеСотрудникомРаботы.Обороты(&НачалоПериода, &КонецПериода, , ) КАК ВКМ_ВыполненныеСотрудникомРаботыОбороты
				   |    ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ВКМ_Сотрудники КАК ВКМ_Сотрудники
				   |    ПО ВКМ_ВыполненныеСотрудникомРаботыОбороты.Сотрудник = ВКМ_Сотрудники.Ссылка
				   |
				   |СГРУППИРОВАТЬ ПО
				   |  ВКМ_ВыполненныеСотрудникомРаботыОбороты.Сотрудник";

	Запрос.УстановитьПараметр("НачалоПериода", (НачалоМесяца(КонецДня(Объект.Дата))));
	Запрос.УстановитьПараметр("КонецПериода", (КонецМесяца(КонецДня(Объект.Дата))));

	Выборка = Запрос.Выполнить().Выбрать();

	Пока Выборка.Следующий() Цикл
		НоваяСтрока = Объект.СписокСотрудников.Добавить();
		НоваяСтрока.Сотрудник = Выборка.Сотрудник;
		НоваяСтрока.СуммаНачисления = Выборка.СуммаКОплатеПриход;
		НоваяСтрока.ВидРасчета = ПланыВидовРасчета.ВКМ_ДополнительныеНачисления.ПремияОтВыполненныхРабот;
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура Заполнить(Команда)

	ЗаполнитьНаСервере();

КонецПроцедуры
